#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
google_kms_key_ring.backups: Refreshing state... [id=projects/hayden-agencies-infra/locations/australia-southeast2/keyRings/k8s-backups]
google_service_account.velero: Refreshing state... [id=projects/hayden-agencies-infra/serviceAccounts/velero@hayden-agencies-infra.iam.gserviceaccount.com]
google_service_account.thanos: Refreshing state... [id=projects/hayden-agencies-infra/serviceAccounts/thanos@hayden-agencies-infra.iam.gserviceaccount.com]
google_project_iam_custom_role.velero: Refreshing state... [id=projects/hayden-agencies-infra/roles/velero]
google_project_iam_custom_role.thanos: Refreshing state... [id=projects/hayden-agencies-infra/roles/thanos]
google_kms_key_ring.sops: Refreshing state... [id=projects/hayden-agencies-infra/locations/global/keyRings/sops]
google_service_account.odoo_backup: Refreshing state... [id=projects/hayden-agencies-infra/serviceAccounts/odoo-pg-backup@hayden-agencies-infra.iam.gserviceaccount.com]
google_project_iam_custom_role.sops: Refreshing state... [id=projects/hayden-agencies-infra/roles/sops]
google_service_account_key.odoo_backup: Refreshing state... [id=projects/hayden-agencies-infra/serviceAccounts/odoo-pg-backup@hayden-agencies-infra.iam.gserviceaccount.com/keys/5c037786d18fa99fef861e32c062bd2eab3bc133]
google_kms_crypto_key.sops: Refreshing state... [id=projects/hayden-agencies-infra/locations/global/keyRings/sops/cryptoKeys/sops-key]
google_service_account_key.thanos: Refreshing state... [id=projects/hayden-agencies-infra/serviceAccounts/thanos@hayden-agencies-infra.iam.gserviceaccount.com/keys/5b4369c7990923463f5960c2839f14e0e6286a37]
google_service_account_key.velero: Refreshing state... [id=projects/hayden-agencies-infra/serviceAccounts/velero@hayden-agencies-infra.iam.gserviceaccount.com/keys/ec18a3dabe485b5952a8d13b64b7a5b38720b94f]
google_project_iam_binding.thanos: Refreshing state... [id=hayden-agencies-infra/projects/hayden-agencies-infra/roles/thanos]
google_project_iam_binding.sops: Refreshing state... [id=hayden-agencies-infra/projects/hayden-agencies-infra/roles/sops]
google_project_iam_binding.velero: Refreshing state... [id=hayden-agencies-infra/projects/hayden-agencies-infra/roles/velero]
google_kms_crypto_key.backup_encryption: Refreshing state... [id=projects/hayden-agencies-infra/locations/australia-southeast2/keyRings/k8s-backups/cryptoKeys/backup-encryption]
google_kms_crypto_key_iam_member.gcs_backup_encryption: Refreshing state... [id=projects/hayden-agencies-infra/locations/australia-southeast2/keyRings/k8s-backups/cryptoKeys/backup-encryption/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceAccount:service-854101959314@gs-project-accounts.iam.gserviceaccount.com]
google_storage_bucket.velero: Refreshing state... [id=hayden-velero-backups]
google_storage_bucket.openebs: Refreshing state... [id=hayden-openebs-backups]
google_storage_bucket.odoo_backups: Refreshing state... [id=hayden-odoo-backups]
google_storage_bucket.thanos: Refreshing state... [id=hayden-thanos-storage]
google_storage_bucket_iam_binding.binding: Refreshing state... [id=b/hayden-openebs-backups/projects/hayden-agencies-infra/roles/velero]
google_storage_bucket_iam_member.velero_object_admin: Refreshing state... [id=b/hayden-velero-backups/roles/storage.objectAdmin/serviceAccount:velero@hayden-agencies-infra.iam.gserviceaccount.com]
google_storage_bucket_iam_member.thanos_object_admin: Refreshing state... [id=b/hayden-thanos-storage/roles/storage.objectAdmin/serviceAccount:thanos@hayden-agencies-infra.iam.gserviceaccount.com]
google_storage_bucket_iam_member.odoo_backup_object_admin: Refreshing state... [id=b/hayden-odoo-backups/roles/storage.objectAdmin/serviceAccount:odoo-pg-backup@hayden-agencies-infra.iam.gserviceaccount.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # google_service_account_key.odoo_backup has been deleted
  - resource "google_service_account_key" "odoo_backup" {
        id                 = "projects/hayden-agencies-infra/serviceAccounts/odoo-pg-backup@hayden-agencies-infra.iam.gserviceaccount.com/keys/5c037786d18fa99fef861e32c062bd2eab3bc133"
        name               = "projects/hayden-agencies-infra/serviceAccounts/odoo-pg-backup@hayden-agencies-infra.iam.gserviceaccount.com/keys/5c037786d18fa99fef861e32c062bd2eab3bc133"
      - private_key        = (sensitive value) -> null
        # (7 unchanged attributes hidden)
    }

  # google_service_account_key.thanos has been deleted
  - resource "google_service_account_key" "thanos" {
        id                 = "projects/hayden-agencies-infra/serviceAccounts/thanos@hayden-agencies-infra.iam.gserviceaccount.com/keys/5b4369c7990923463f5960c2839f14e0e6286a37"
        name               = "projects/hayden-agencies-infra/serviceAccounts/thanos@hayden-agencies-infra.iam.gserviceaccount.com/keys/5b4369c7990923463f5960c2839f14e0e6286a37"
      - private_key        = (sensitive value) -> null
        # (7 unchanged attributes hidden)
    }

  # google_service_account_key.velero has been deleted
  - resource "google_service_account_key" "velero" {
        id                 = "projects/hayden-agencies-infra/serviceAccounts/velero@hayden-agencies-infra.iam.gserviceaccount.com/keys/ec18a3dabe485b5952a8d13b64b7a5b38720b94f"
        name               = "projects/hayden-agencies-infra/serviceAccounts/velero@hayden-agencies-infra.iam.gserviceaccount.com/keys/ec18a3dabe485b5952a8d13b64b7a5b38720b94f"
      - private_key        = (sensitive value) -> null
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_project_iam_binding.sops will be updated in-place
  ~ resource "google_project_iam_binding" "sops" {
        id      = "hayden-agencies-infra/projects/hayden-agencies-infra/roles/sops"
      ~ members = [
          + "user:thomas@haydenagencies.com.au",
        ]
        # (3 unchanged attributes hidden)
    }

  # google_service_account_key.odoo_backup will be created
  + resource "google_service_account_key" "odoo_backup" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = "projects/hayden-agencies-infra/serviceAccounts/odoo-pg-backup@hayden-agencies-infra.iam.gserviceaccount.com"
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # google_service_account_key.thanos will be created
  + resource "google_service_account_key" "thanos" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = "projects/hayden-agencies-infra/serviceAccounts/thanos@hayden-agencies-infra.iam.gserviceaccount.com"
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # google_service_account_key.velero will be created
  + resource "google_service_account_key" "velero" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = "projects/hayden-agencies-infra/serviceAccounts/velero@hayden-agencies-infra.iam.gserviceaccount.com"
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ odoo_backup_sa_key   = (sensitive value)
  ~ thanos_sa_key        = (sensitive value)
  ~ velero_sa_key        = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @mak011p, Action: `pull_request`, Working Directory: `terraform/gcp`, Workflow: `Terraform: Plan And Apply`*